{"Unnamed: 0":24,"name":"Lava Vine Winery Napa Valley Cabernet Sauvignon 2014","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":91.0,"notes":"A wonderful representation of how amazing the 2014 vintage could be and how to balance Napa Valley’s Intensity. A ripe cherry and cassis entry with dusted cocoa and a touch of graham cracker entice. The silky rich entry is so balanced there seems to be no separation from mid-palate through the lengthy finish with multitudes of fruit and spice to accompany. This Cabernet Sauvignon is fully integrated, super complex and will age beautifully."}
{"Unnamed: 0":25,"name":"Lava Vine Winery Napa Valley Reserve Cabernet Sauvignon 2012","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":92.0,"notes":"Black berries and hints of strawberry invite with muddled cherry cola spices. Deep earthy tones on a silk entry proceed to a rich, full mid-palate. Expressive tannins make for a beautiful finish."}
{"Unnamed: 0":26,"name":"Lava Vine Winery Napa Valley Reserve Cabernet Sauvignon 2013","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":92.0,"notes":"A slight minty nose with dark chocolate and fresh blueberry captivate the senses. Notes of a baking spice dance on the pallet before giving way to rich, dark, and earthy finish. This extremely balanced gem will continue to show plenty of structure and integrity for years to come. Enjoy!"}
{"Unnamed: 0":288,"name":"Leaping Lizard Cabernet Sauvignon 2007","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":90.0,"notes":"Our Cabernet Sauvignon is a full-bodied, fruit-forward wine that shows great structure with balanced acidity. Cassis, plum and crushed berry aromas are layered with a slight perfume\/floral note and a hint of spicy oak. Red fruit flavors are found on the mid-palate through to the lingering finish. This wine is aged for 18 months  in a mix of old and new oak barrels giving the wine a velvety finish with fine-grain tannins and a soft mouthfeel."}
{"Unnamed: 0":685,"name":"Levendi Stagecoach Cabernet Sauvignon 2008","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":94.0,"notes":"From the Stagecoach Vineyard high on the eastern volcanic ridge above Napa, comes this rich and decadent, limited production Cabernet Sauvignon. The vivid red soils and rocky slopes come together to produce a wine with an aroma of sweet blackberry and cassis fruit that carries over into a superbly balanced and polished palate. "}
{"Unnamed: 0":686,"name":"Levendi Sweeney Ranch Chardonnay 2010","grape":null,"region":"Napa Valley, California","variety":"White Wine","rating":93.0,"notes":"Beautifully ripe apple with a hint of caramel and oak spice, filled in with lemon chiffon notes. Caramelized apple and lemon vanilla cream flavors on the palate, with the texture gracefully balanced between a rich center and a crisp finish."}
{"Unnamed: 0":692,"name":"Levy & McClellan Proprietary Red 2004","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":95.0,"notes":"Full-bodied yet beautifully silky and seductive, it has shed most of its tannins, resulting in a complex, singular red wine of majestic proportions."}
{"Unnamed: 0":693,"name":"Levy & McClellan Proprietary Red 2005","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":95.0,"notes":"Uncompromising viticultural practices andmeticulously detailed vinification rewarded us with a wine ofgreat concentration and ripeness. The round supple tanninsin the 2005 Levy & McClellan are the result of thecool growing conditions and the extended ripening. As the wine develops, the expression of the site where it is grown continues to come to the forefront. Accentuated by the low yield in a year known for more generosity, combined with26 months in barrel, the result is a profoundly concentrated, supple and full-bodied wine."}
{"Unnamed: 0":694,"name":"Lewelling Cabernet Sauvignon 2000","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":90.0,"notes":"Medium-red color. Dark, Bordeaux-like aromas of currant and cedar, medium-full body, bright red currant and ripe cherry-like fruit on the palate, notes of cocoa and roasted coffee, very lively on the palate, a touch of oak (but not sweet) and cedar. Nice balance and shows exceptional length. This is not a fruit bomb--it has the real depth and class that many wines at twice the price wish they had. Should pair well with any veal or beef dish, lamb, pork loin or chops, and chicken dishes made with  mushrooms. Pretty good with medium-strong cheeses, too.  "}
{"Unnamed: 0":695,"name":"Lewelling Cabernet Sauvignon 2005","grape":null,"region":"St. Helena, Napa Valley, California","variety":"Red Wine","rating":92.0,"notes":"A bright bouquet of wild black raspberry, dark plum, and Rainier cherry joined by vanilla, sweet tobacco and new saddle leather. A lively blend of blackberry, jammy raspberry and black currant fruit mingled with black pepper and baking spice, reinforced by assertive yet balanced sweet tannins and refreshing acidity."}
{"Unnamed: 0":696,"name":"Lewelling Cabernet Sauvignon 2001","grape":null,"region":"St. Helena, Napa Valley, California","variety":"Red Wine","rating":93.0,"notes":"Intense black cherry, plum, and berry aromas intermingled with notes of anise, pain grille, and cedar. Rich cherry, red plum and raspberry flavors; white pepper, tobacco, and allspice; full-bodied with sweet, chewy tannins, balanced ripeness and fresh acidity."}
{"Unnamed: 0":697,"name":"Lewelling Cabernet Sauvignon 2006","grape":null,"region":"St. Helena, Napa Valley, California","variety":"Red Wine","rating":93.0,"notes":"An enticing mix of sweet black cherry, chocolate, and tobacco aromas. A blend of bramble berry and black cherry fruit mixed with exotic spice, earth, and tobacco flavors, backed by substantial, velvety tannins, marvelous texture and a lengthy finish. "}
{"Unnamed: 0":698,"name":"Lewelling Cabernet Sauvignon 2007","grape":null,"region":"St. Helena, Napa Valley, California","variety":"Red Wine","rating":95.0,"notes":"Intense black cherry, plum, and berry aromas intermingled with notes of anise, pain grille, and cedar. Rich cherry, red plum and raspberry flavors; white pepper, tobacco, and allspice; full-bodied with sweet, chewy tannins, balanced ripeness and fresh acidity."}
{"Unnamed: 0":699,"name":"Lewelling Cabernet Sauvignon 2009","grape":null,"region":"St. Helena, Napa Valley, California","variety":"Red Wine","rating":93.0,"notes":"Red cherry, plum and brambleberry aromas with hints of cedar and chocolate. Vibrant blackberry, plum and tart cherry fruit intermingled with allspice, white pepper and vanilla on the palate with polished tannins and a long finish."}
{"Unnamed: 0":700,"name":"Lewelling Cabernet Sauvignon 2010","grape":null,"region":"St. Helena, Napa Valley, California","variety":"Red Wine","rating":92.0,"notes":"An enticing mix of sweet black cherry, currant, dark cocoa, and toasty oak aromas. A blend of blackberry and black cherry fruit mixed with cassis, mineral, espresso and tobacco flavors; round, chewy tannins, marvellous texture and a lengthy finish."}
{"Unnamed: 0":701,"name":"Lewelling Cabernet Sauvignon 2012","grape":null,"region":"St. Helena, Napa Valley, California","variety":"Red Wine","rating":92.0,"notes":"Aromas of Bing cherry, currant and blackberry fruit, cocoa, vanilla, and baking spices. Intense blackberry, cassis, plum, and cherry flavors;coffee, anise and mineral; full-bodied, with fresh acidity,sweet, silky tannins and a rich mouth-feel."}
{"Unnamed: 0":702,"name":"Lewelling Wight Vineyard Cabernet Sauvignon 2003","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":94.0,"notes":"The bouquet is blackberry, black currant, roasted coffee, vanilla and exotic spice aromas.  The flavor is rich black cherry and currant, licorice, mineral and expresso flavors; superb body and complexity coupled with balanced ripeness and fresh acidity; polished but firm tannins, layered richness and a long finish."}
{"Unnamed: 0":703,"name":"Lewelling Wight Vineyard Cabernet Sauvignon 2005","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":94.0,"notes":"Bouquet: opulent aromas of black currant, blackberry, cherry, vanilla, and sweet toasty oak with a hint of anise."}
{"Unnamed: 0":704,"name":"Lewelling Wight Vineyard Cabernet Sauvignon 2006","grape":null,"region":"St. Helena, Napa Valley, California","variety":"Red Wine","rating":94.0,"notes":"Sumptuous aromas of rich dark berries, vanilla, and sweet smoke Flavors are sweet black cherry and blackberry flavors mingled with tobacco, mineral and wood smoke; bold, substantial tannins, mouthfilling richness, layered complexity, and a strong finish. "}
{"Unnamed: 0":705,"name":"Lewelling Wight Vineyard Cabernet Sauvignon 2009","grape":null,"region":"St. Helena, Napa Valley, California","variety":"Red Wine","rating":95.0,"notes":"Bouquet of enticing raspberry, cassis, and red plum aromas mixed with notes of chocolate and toasty oak. Flavors are rich blueberry, Bing cherry, and red raspberry flavors are also mingled with woodsmoke, earth, and spice; mouthfilling, velvety tannins and a complex, lingering finish."}
{"Unnamed: 0":706,"name":"Lewelling Wight Vineyard Cabernet Sauvignon 2008","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":98.0,"notes":"Sumptuous aromas of blackberry, cassis, Bing cherry and spice mixed with highlights of tobacco, cedar, vanilla and anise. Concentrated black plum, black cherry, and cassis flavors; allspice, dark cocoa, juniper and sweet smoke; exceptional depth and complexity; multi-layered richness; mouthfilling, velvety tannins and a lingering finish."}
{"Unnamed: 0":707,"name":"Lewelling Wight Vineyard Cabernet Sauvignon 2007","grape":null,"region":"St. Helena, Napa Valley, California","variety":"Red Wine","rating":98.0,"notes":"An enticing mix of black fruit, tobacco and toasty oak aromas mingled with highlights of vanilla, cedar and licorice.  Concentrated black cherry, cassis, blueberry pie and espresso flavors; sweet smoke, anise and cedar; mouth-filling complexity and layered richness; dense but polished tannins and a very long finish."}
{"Unnamed: 0":708,"name":"Lewelling Wight Vineyard Cabernet Sauvignon 2010","grape":null,"region":"St. Helena, Napa Valley, California","variety":"Red Wine","rating":94.0,"notes":"Sumptuous aromas of rich dark berries, cassis, vanilla, and sweet smoke. Bing cherry, blackcurrant and blackberry flavors mingled with spice box, mineral and dark cocoa; velvety tannins, mouthfilling richness, layered complexity, and a lingering finish."}
{"Unnamed: 0":709,"name":"Lewis Cellars Alec's Blend Red 2002","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":96.0,"notes":"Number 12 on"}
{"Unnamed: 0":710,"name":"Lewis Cellars Alec's Blend Red 2003","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":91.0,"notes":"The formula for the 2002 Alec's Blend was so successful the winery again combined 60% Syrah, 30% Merlot, and 10% Cabernet Sauvignon to create this delicious wine, named after Dennis' first son. The wine is loaded with seductive oak spice, candle wax, and ripe black fruit. Hedonistic, rich, and complex, the wine has great mouth-feel with balance, depth, and a long, lingering finish."}
{"Unnamed: 0":711,"name":"Lewis Cellars Alec's Blend Red 2007","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":92.0,"notes":"These days drifting the rear wheel of his 4-stroke bike on a dirt oval is Alec's idea of fun, while his 2007 vintage wine is a straight-line sprint to pleasure. 70% Syrah, 20% Cabernet Sauvignon and 10% Merlot, this is one sweet ride, loaded with wild blackberries and laced with mocha, cola, and vanilla oak spice. Super-smooth, plush and round, there's plenty of throttle too, with chocolaty tannins and just enough grip to keep the fun serious. 1,400 cases produced."}
{"Unnamed: 0":712,"name":"Lewis Cellars Alec's Blend Red 2009","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":94.0,"notes":"With Alec already starting high school it's feeling like life in the fast lane. Top Gear is actually his favorite TV show and this new blend of 80% Syrah, 17% Merlot and 3% Cabernet Sauvignon packs plenty of power and youthful pleasure. Sappy black cherry and blueberry fruits are injected with clove and vanilla oak spice plus traces of truffle and sandalwood. Lively off the line, the palate performs with all the complex componentry and smooth power of a 4-valve, liquid-cooled 4-stroke engine."}
{"Unnamed: 0":713,"name":"Lewis Cellars Alec's Blend Red 2005","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":92.0,"notes":"Everyone agrees that Alec is one sweet kid, and his blend from the 2005 vintage is the wine equivalent of \"wild mountain blackberry\" –a favorite flavor ice cream from childhood. 70% Syrah and 30% Cabernet Sauvignon, the wine is opulent, ripe and seductive with cedar-laced oak spice aromas, coffee shadings and scoopfuls of juicy black fruit. The plush palate packs a chocolate truffle surprise with great length and soft, chewy tannins."}
{"Unnamed: 0":714,"name":"Lewis Cellars Alec's Blend Red 2010","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":93.0,"notes":"All-mountain is Alec's favorite kind of cycling and it best describes this deliciously complex blend.  Heading up trail, the air is heavy with wild blueberry, violets, and oak forest aromas.  Dropping into descent, deep chutes of blue-black fruit consume a full 160mm of fork travel.  Picking up speed the palate turns lively and technical with youthful acidity and some tight twists through the trees.  Mocha and espresso bean flavors kick in just as you glide through the dust to a fine chocolaty finish. "}
{"Unnamed: 0":715,"name":"Lewis Cellars Alec's Blend Red 2014","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":92.0,"notes":"With one year of college completed, Alec's wine is both boy and man in this boundary-pushing blend of Syrah 60%, Merlot 34% and Cabernet 6%. Asserting his independence through explosively ripe blackberry and huckleberry fruits, there's also kirsch-like cherry cola, spicy oak, supple tannin and a trace of s'mores that's closer to home. Tremendously youthful and seriously good fun, Alec's Blend remains a kid at heart."}
{"Unnamed: 0":716,"name":"Lewis Cellars Alec's Blend Red 2013","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":94.0,"notes":"A blend of 60% Syrah, 22% Merlot and 18% Cabernet Sauvignon - a power trio of guitar, bass and drums that rocks harder than any vintage in recent memory. Super ripe blackberry, vanilla blueberry, mocha and oak spices gain presence and steadily push the volume past 10. Tons of ripe, hedonistic fruit brings big stage presence while handsomely hewn tannins add drive and keep this wall of sound distortion free."}
{"Unnamed: 0":717,"name":"Lewis Cellars Alec's Blend Red 2017","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":92.0,"notes":"Complex and fruit-forward with opulent black cherry and a dash of sweet molasses. Sporting plush palate texture throughout, the wine finishes with delicious chocolatey tannins. "}
{"Unnamed: 0":724,"name":"Lewis Cellars Cabernet Sauvignon 2002","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":96.0,"notes":"Showcasing the unique personalities of small hillside vineyards from Pritchard Hill, Oakville and Rutherford, the 2002 Napa Valley Cabernet delivers compelling aromas of mocha, ripe berries, tobacco and sweet oak spice. The wine is 100% Cabernet Sauvignon, complex, rich and focused. With a deep core of black fruit and traces of briar and vanilla, it turns chocolaty and long on the palate with serious, integrated tannins."}
{"Unnamed: 0":725,"name":"Lewis Cellars Cabernet Sauvignon 2004","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":93.0,"notes":"Showcasing the unique personalities of small hillside vineyards from Pritchard Hill, Rutherford, and Calistoga our 2004 Napa Valley Cabernet delivers compelling aromas of black currant, mocha and sweet oak spice. 100% Cabernet Sauvignon, the wine is complex, rich and focused. Built around a core of concentrated fruit, it serves up sumptuous, round, mouth-feel with traces of tobacco and briar. Beautifully structured, the wine develops distinctive chocolate flavors that travel long on the finish with finely integrated tannins."}
{"Unnamed: 0":726,"name":"Lewis Cellars Cabernet Sauvignon 2005","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":91.0,"notes":"Showcasing the unique personalities of small hillside vineyards from Pritchard Hill, Rutherford, and Calistoga our 2005 Napa Valley Cabernet delivers complex aromas of black currant, sweet oak spice, espresso and tobacco. 100% Cabernet Sauvignon, the wine makes a sweeping broad entry with briary, black fruit at the core and compelling chocolate flavors that yield to a long chewy finish."}
{"Unnamed: 0":727,"name":"Lewis Cellars Cabernet Sauvignon 2012","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":94.0,"notes":"The 2012 ranks among Lewis Cellars' best bottlings of Napa Cabernet. Enticing, deep-fruited aromas of black currant, berry and chocolate are stippled with cedar, clove and cinnamon oak spices. The palate centers on opulent core fruit that swirls around a defined structure of supple tannins. With complex undertones of truffle, black pepper and briar, this interplay finally winds down to a long chocolaty finish."}
{"Unnamed: 0":728,"name":"Lewis Cellars Cabernet Sauvignon 2015","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":93.0,"notes":"Like an Aston Martin V-12 the 2015 Napa Valley Cabernet is a silky powerhouse of fruit at wide-open-throttle. Black currant, plum and juicy ripe berries rev freely on the palate with seductive oak spice, candle wax and semi-sweet chocolate aromas. Fine-tuned and polished, the wine is deceptively powerful with supple, sweeping tannins."}
{"Unnamed: 0":729,"name":"Lewis Cellars Cabernet Sauvignon 2014","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":94.0,"notes":"Our 2014 Napa Valley Cab takes center stage in a flashy jumpsuit with super plush fruit and sexy oak spices - Elvis is in the house! There's a whole lotta fruit going on, playing out in perfect pitch and velvety voice - it's irresistibly good. Classic, three-chord composition provides structure with notes of cedar, clove and sweet tobacco for added melody. Finely polished with chocolaty tannins, something like blue suede shoes."}
{"Unnamed: 0":730,"name":"Lewis Cellars Cabernet Sauvignon 2013","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":95.0,"notes":"#1"}
{"Unnamed: 0":731,"name":"Lewis Cellars Cabernet Sauvignon 2017","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":92.0,"notes":"Dense, layered aromas with sweet cocoa, alluring oak spice and wow-factor frontal fruit, the wine is showy yet seriously structured. Creamy melted berry character gives way to supple muscle with integrated tannins and a long, lavish finish."}
{"Unnamed: 0":732,"name":"Lewis Cellars Cuvee L 2005","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":95.0,"notes":"Think of Cuvee L as super-charged Lewis Reserve Cabernet. Red wine at red-line. First created from the spectacular 1997 vintage, the single best barrels from our finest lots fuel this rare wine. Cuvee L is not produced every year. It is only blended when we have the components to create a wine of greater intensity, depth and distinction than our Reserve Cabernet. "}
{"Unnamed: 0":733,"name":"Lewis Cellars Cuvee L 2006","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":93.0,"notes":"First created from the spectacular 1997 vintage, the single best barrels from our finest lots fuel this rare wine. Think of Cuvee L as super-charged Lewis Reserve Cabernet. Cuvee L is not produced every year. It is only blended when we have the components to create a wine of greater intensity, depth and distinction than our Reserve Cabernet. "}
{"Unnamed: 0":734,"name":"Lewis Cellars Cuvee L Cabernet Sauvignon 2014","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":95.0,"notes":"Our 2014 Cuvee L carries a cargo of fruit more laden than a Spanish galleon. Awash with crushed berries, clove and black truffle the wine superbly melds redolent ripe fruit with sweet oak spices. Broad and round on entry, this 100% Cabernet Sauvignon swells at mid-palate and packs a plush yet potent finish like a chocolate-coated cannonball."}
{"Unnamed: 0":735,"name":"Lewis Cellars Cuvee L Cabernet Sauvignon 2015","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":96.0,"notes":"Straight from James Fenimore Cooper’s novel, Last of the Mohicans, comes our 2015 Cuvee L – a noble savage from an outstanding vintage with great depth of character. 100% Cabernet Sauvignon with the strength of a grizzly and the soul of a chief this onyx and indigo wine is cloaked in tiers of blackberry with a quiver of clove and cedary oak spices. Broad paths of richly rendered fruit trail into hand-hewn tannins reflecting nature’s winding ways."}
{"Unnamed: 0":736,"name":"Lewis Cellars Hillstone Vineyard Cabernet Sauvignon 2014","grape":null,"region":"Rutherford, Napa Valley, California","variety":"Red Wine","rating":94.0,"notes":"This gorgeous wine, equal parts show-house and rustic cabin, sits along an alpine lake deep with black currants and massive ripe fruit. The air is redolent, with blackberry, clove, candle wax and vanilla oak spices. Picking up weight and muscle below the surface, the wine is anchored in fine tannins."}
{"Unnamed: 0":737,"name":"Lewis Cellars Hudson Vineyards Syrah 2006","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":91.0,"notes":"The relatively cool 2006 harvest enhanced the inherent Rhone character of our Hudson Vineyards Syrah from these famously farmed vines in Napa Carneros. Finely woven and complex this 100% Syrah from a single small block serves up a potpourri of red\/black fruits, white pepper, herbes de Provence, and allspice. Black raspberry fruit flavors are framed in toasty oak and brought to fine focus. "}
{"Unnamed: 0":738,"name":"Lewis Cellars Mason's Cabernet Sauvignon 2003","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":93.0,"notes":"In keeping with family tradition, this bottling celebrates the birth of Dennis' third son, Mason, in January 2003. Mason's wine is 100% Cabernet Sauvignon sourced from a single vineyard on a sunny ridge high on Mt. Veeder, farmed by Napa Valley legend, David Abreu. The wine is plush and spicy with ripe, forward fruit and soft, round tannins, brimming with wild berries, toasty oak and shadings of briar and tobacco."}
{"Unnamed: 0":739,"name":"Lewis Cellars Mason's Cabernet Sauvignon 2015","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":91.0,"notes":"Mason has been going to CrossFit and it shows. No whiskers yet but his 2015 vintage has more serious character, complexity and muscle than ever. Redolent with deeply ripened berries, baker's chocolate, cola, and cedary oak spice the wine is concentrated and rich on entry. Picking up notes of café latte toward the finish, a network of sinewy yet supple tannins provides a platform for this bulked up wine. "}
{"Unnamed: 0":740,"name":"Lewis Cellars Mason's Cabernet Sauvignon 2018","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":92.0,"notes":"Sporting some Senior-year swagger, the 2018 Mason’s Cabernet is front-loaded with black plum, cherry, chocolate and cedary spice.  Sourced from several of the same vineyards as our Napa Cabernet this wine is boldly fruited yet youthful with tons of juicy character and a deliciously fresh finish."}
{"Unnamed: 0":741,"name":"Lewis Cellars Merlot 2000","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":91.0,"notes":"Bursting with black plum and sweet cedar our Merlot is opulent and delicious, rivaling any of our Merlot bottlings to date. These low-yielding vines from Oakville, Oak Knoll and Pritchard Hill have produced a wine that is smooth, yet thickly textured, jammy yet serious."}
{"Unnamed: 0":742,"name":"Lewis Cellars Napa Valley Chardonnay 2008","grape":null,"region":"Napa Valley, California","variety":"White Wine","rating":91.0,"notes":"Crafted from a combination of Oak Knoll vines and longer-hanging Carneros clusters, our 2008 Napa Valley Chardonnay is satisfyingly ripe, yet focused and fresh in the same sip. Showy stone fruit, pear, hazelnut and toasty oak spices spill from the glass. Rich-bodied, fruitful and round on the palate with vanilla and subtle minerality, the wine is threaded with lively acidity bringing length and focus to a fine finish."}
{"Unnamed: 0":743,"name":"Lewis Cellars Napa Valley Chardonnay 2015","grape":null,"region":"Napa Valley, California","variety":"White Wine","rating":92.0,"notes":"Grapes for the 2015 Napa Chardonnay came in early and the wine centers around ripe Bosc pear and Fuji apple with delicious caramel custard, pie crust and hazelnut. Thickly textured and satiny smooth like Deux-Sevres butter, the richness and weight are buttressed with native acidity and subtle minerality bringing complexity and length to this delicious wine."}
{"Unnamed: 0":744,"name":"Lewis Cellars Napa Valley Chardonnay 2014","grape":null,"region":"Napa Valley, California","variety":"White Wine","rating":95.0,"notes":"Another warm vintage and generous crop brought plenty of sun-kissed fruit for our 2014 Napa Valley Chardonnay. Ripened red and green pears with white peach are threaded with tantalizing cinnamon, nutmeg and caramel spices. The cream-textured palate is opulent, full-bodied and delicious with notes of vanilla, mineral and flaky croissant that carry into a long and increasingly focused finish. "}
{"Unnamed: 0":745,"name":"Lewis Cellars Napa Valley Chardonnay 2016","grape":null,"region":"Napa Valley, California","variety":"White Wine","rating":92.0,"notes":"Golden delicious apple, honeysuckle blossom and toasty caramel spice aromas are served up generously in the 2016 Napa Chardonnay. Silky in texture with ripe tree fruit and plenty of drive the wine is athletic and complex with a tail of smoky mineral and lees character."}
{"Unnamed: 0":746,"name":"Lewis Cellars Napa Valley Syrah 2006","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":93.0,"notes":"Crafted from hillside blocks in low-vigor volcanic soils at 1,500 feet, this 100% Syrah shows a taut, restrained character before erupting loads of oaky sweet spice, vanilla and cocoa aromas. At its core, the 2006 Syrah is dense and deeply fruited with ripe blueberry and brooding black fruit, thick with fleshy texture and firm tannins."}
{"Unnamed: 0":747,"name":"Lewis Cellars Napa Valley Syrah 2007","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":94.0,"notes":"Our 2007 Syrah Napa Valley is the muscle car, the big-block powered bottle from our Rhone wine line-up. Mountain vines in low-vigor volcanic soils at 1,500 feet yield high-octane juice that's practically jet-black and packed with cedary oak spice and smoky dark fruit. Brambly, lifted and dense, the wine is also vibrant and fresh, framed with chewy, long-throw tannins that travel far down the road."}
{"Unnamed: 0":748,"name":"Lewis Cellars Reserve Cabernet Sauvignon (1.5 Liter Magnum) 2011","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":93.0,"notes":"Scarce in quantity the 2011 Reserve Cabernet delivers plenty of complex aromas and lots of classic character. Sourced from a small collection of hillside and benchland vineyards in Calistoga, Oak Knoll and Rutherford, the wine centers around ripe currant and blue-black fruits threaded with tobacco leaf, nutmeg, baking spices and sweet toasty oak. Elegant and supple at first sip the wine gains focus, finishing with fine structure."}
{"Unnamed: 0":749,"name":"Lewis Cellars Reserve Cabernet Sauvignon (1.5 Liter Magnum) 2016","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":93.0,"notes":"This Cabernet is a silky powerhouse of fruit at wide-open-throttle. Black currant, plum and juicy ripe berries rev freely on the palate with seductive oak spice, candle wax and semi-sweet chocolate aromas. Fine-tuned and polished, the wine is deceptively powerful with supple, sweeping tannins."}
{"Unnamed: 0":750,"name":"Lewis Cellars Reserve Cabernet Sauvignon (1.5L Magnum) 2004","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":93.0,"notes":"This 2004 bottling could be Lewis Cellars' most captivating Reserve Cabernet Sauvignon yet. It combines the breadth and power of vintages like ’97 and ’01, with the depth and rich fruit of the ’02 vintage. Crafted from Pritchard Hill, Calistoga, Rutherford and Oak Knoll hillside vineyards and blended with 8% Cabernet Franc, the nose is a powder keg of explosive black fruit and blueberries with seamlessly fused oak spices, cedar, cocoa and espresso. The palate is a cannonball of concentrated core fruit with delicious, chewy texture and rich, round mouthfeel that travels leagues on sinewy tannins."}
{"Unnamed: 0":751,"name":"Lewis Cellars Reserve Cabernet Sauvignon 1995","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":90.0,"notes":"The nose is powerful with cedar, oak and blackberry aromas. The palate is muscular, densely layered with black fruit and dark chocolate flavors, integrated with full round tannins. Delicious now, this wine will continue to improve with bottle age."}
{"Unnamed: 0":752,"name":"Lewis Cellars Reserve Cabernet Sauvignon 2000","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":91.0,"notes":"Our 2000 Reserve Cabernet is a beautiful, showy wine, spilling-over with spicy oak and aromatic cedar, centered on opulent black fruit. Absolutely rich, ripe and round, we used 90% Cabernet Sauvignon, 7% Cabernet Franc and 3% Merlot in this Reserve blend. A cloak of vanilla, clove and seductive oak spice wraps around a deeply fruited core of currant and wild berries with hints of anise and chocolate that gradually give way to long, mouth-coating tannins. 2,300 cases produced. "}
{"Unnamed: 0":753,"name":"Lewis Cellars Reserve Cabernet Sauvignon 2005","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":93.0,"notes":"Our 2005 Reserve Cabernet Sauvignon is a broad-shouldered blend of 93% Cabernet and 7% Cabernet Franc, crafted from Pritchard Hill, Calistoga, Rutherford and Oak Knoll hillside vineyards. The nose is saturated with blackberry and sweet oak spice, tinged with toffee and chocolate. On entry the wine is brooding, tightly packed with fleshy fruit and sinewy texture that gathers richness and length on the palate with satisfying, fine-grained tannins."}
{"Unnamed: 0":754,"name":"Lewis Cellars Reserve Cabernet Sauvignon 2006","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":95.0,"notes":"Seductive, sleek and serious best describe our 2006 Reserve Cabernet Sauvignon. 96% Cabernet and 4% Cabernet Franc, this opulent wine is crafted from Pritchard Hill, Calistoga, Rutherford and Oak Knoll hillside vineyards. Cedary sweet oak spice, black fruit and cocoa aromas are potent. On entry the wine is deeply fruited, plush and round with kirsch, café mocha and blackberry flavors supporting very supple, fine-grained tannins and delivering great texture and length."}
{"Unnamed: 0":755,"name":"Lewis Cellars Reserve Cabernet Sauvignon 2007","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":95.0,"notes":"From the exceptional 2007 vintage, with production down 15% from 2006, we have crafted a densely woven, deeply fruited Reserve Cabernet rooted in Pritchard Hill, Calistoga, Rutherford and Oak Knoll hillside vineyards. Broad-shouldered and muscular, this blend of 97% Cabernet Sauvignon and 3% Cabernet Franc is packed with black currants and berries, dark chocolate, espresso, and sweet cedar and oak spice. Thickly textured on a massive scale with saturated fruit and sinewy tannins, this wine will stand tall for many years. 1,700 cases produced."}
{"Unnamed: 0":756,"name":"Lewis Cellars Reserve Cabernet Sauvignon 2008","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":94.0,"notes":"Built for comfort as much as speed, the 2008 vintage is packed with fruit and ready to roll, reminding us of our outstanding 2002 Reserve Cabernet. Like the rich interior of a Ferrari GTB, the nose is showy, ripe and rustic with black currant, clove, tar and exotic oak spices. Under the hood this blend of 98% Cabernet Sauvignon and 2% Petit Verdot shows plenty of extract and fleshy fruit delivering seamless power and expansive mouth feel. Moderate, chocolaty tannins engage mid-palate to gradually tighten the chassis and bring a lively quality to the ride."}
{"Unnamed: 0":757,"name":"Lewis Cellars Reserve Cabernet Sauvignon 2009","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":94.0,"notes":"This elegant and opulently spiced 2009 Reserve Cabernet is sourced from a small collection of hillside and benchland vineyards rooted in the Oak Knoll and Calistoga appellations. Infused with exotic oak, cocoa and clove spices this blend of 98% Cabernet Sauvignon and 2% Petit Verdot is powerfully aromatic. Sweet black currant and boysenberry flavors gradually take the backseat to a more muscular mid-palate framed with sinewy tannins and baker's chocolate."}
{"Unnamed: 0":758,"name":"Lewis Cellars Reserve Cabernet Sauvignon 2010","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":96.0,"notes":null}
{"Unnamed: 0":759,"name":"Lewis Cellars Reserve Cabernet Sauvignon 2011","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":93.0,"notes":"Scarce in quantity the 2011 Reserve Cabernet delivers plenty of complex aromas and lots of classic character. Sourced from a small collection of hillside and benchland vineyards in Calistoga, Oak Knoll and Rutherford, the wine centers around ripe currant and blue-black fruits threaded with tobacco leaf, nutmeg, baking spices and sweet toasty oak. Elegant and supple at first sip the wine gains focus, finishing with fine structure."}
{"Unnamed: 0":760,"name":"Lewis Cellars Reserve Cabernet Sauvignon 2015","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":93.0,"notes":"From the outstanding 2015 vintage the Reserve Cabernet is powerfully seductive, brilliant and black in hue with kirsch-like crushed berries and showy cedar spice. Ripe, hi-tone fruit aromas are laced with candlewax, clove and cocoa. Expansive, with tiers of black fruit and velvety texture, the palate builds depth and power culminating in a muscular, long finish with supple young tannins."}
{"Unnamed: 0":761,"name":"Lewis Cellars Reserve Cabernet Sauvignon 2014","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":95.0,"notes":"The best qualities from our past two vintages come together like yin and yang in our singular 2014 Reserve Cabernet.  Radiant color and soaring aromas of ripe blackberry, toasty oak spices, black truffle and cappuccino make an impressive entrée.  Fleshy and supple at first, the wine expands into deeper, more concentrated fruit layers with chocolaty, fine-grained tannins."}
{"Unnamed: 0":762,"name":"Lewis Cellars Reserve Cabernet Sauvignon 2016","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":93.0,"notes":"There is distinct power and complexity to our 2016 Reserve Cabernet. Navy blue-black yet brilliant in color the wine is front-loaded with ripe fruit of crushed currants and berries. Secondary notes bring mineral and earth aromas laced with sweet anise and oak spice. Packed with fruit on entry, a dusky, sinewy character develops on the palate with fine-grained tannins tailing to the finish."}
{"Unnamed: 0":763,"name":"Lewis Cellars Reserve Cabernet Sauvignon (scuffed labels) 2012","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":96.0,"notes":"The headline reads: \"2012 Reserve Cabernet - Return of the Big Block\". Running on high octane aromas and built on an iron block with deep reserves of black fruit this 100% Cabernet blend delivers 700 horsepower at the wheels. Coming off idle the nose slowly explodes with sappy dark and rustic berries, clove, cedar and sweet oak spices. Forged, ripe fruit pistons pump out the power for miles until finally finishing with an impressive band of ported and polished tannins. Motor must be warmed-up before driving!"}
{"Unnamed: 0":764,"name":"Lewis Cellars Reserve Chardonnay 2008","grape":null,"region":"Napa Valley, California","variety":"White Wine","rating":93.0,"notes":"Bottled unfined and unfiltered in December last year, our 2008 Reserve Chardonnay shows fantastic focus, complexity and richness. There is great breadth and allure in the nose of crushed blossoms and stone, lime zest, hazelnut and pear; but the palate takes center stage. Like a French kiss, the wine is sumptuous and silky-rich in texture with creamy minerality and endlessly intriguing notes of bread crust and caramel. The palate retains great focus and structure throughout, as it leads to a long, luxurious finish."}
{"Unnamed: 0":765,"name":"Lewis Cellars Reserve Chardonnay 2015","grape":null,"region":"Napa Valley, California","variety":"White Wine","rating":92.0,"notes":"Neil Young's \"Cinnamon Girl\" best captures the character of our rocking 2015 Reserve Chardonnay. Ripe yet succulent D'Anjou pear, gardenia blossom, sweet mineral spice and toasty brioche aromas come singing through. Broad-shouldered, with creamy textured leesy flavors, the wine reaches great depth while maintaining precision and serious structure."}
{"Unnamed: 0":766,"name":"Lewis Cellars Reserve Chardonnay 2018","grape":null,"region":"Napa Valley, California","variety":"White Wine","rating":93.0,"notes":"From the long growing season of 2018, this Napa Reserve Chardonnay has super showy aromatics, deliciously complex flavors and alluring texture that can’t be captured in words. Opening with white flower blossoms, green pear, lime zest and crushed stone mineral the wine is fragrant and long-limbed. Profoundly rich and silky texture is underpinned with structural detail and a stunningly long tail."}
{"Unnamed: 0":767,"name":"Lewis Cellars Reserve Chardonnay 2017","grape":null,"region":"Napa Valley, California","variety":"White Wine","rating":93.0,"notes":"Think of our 2017 Reserve Chardonnay as a Rolls Royce Wraith – offering a sumptuous interior with serious performance. A plethora of heady aromas alight from the glass with Anjou pear, warm brioche, sweet mineral spice and gardenia blossom. Lush yet lively with great depth and gauzy texture the wine shows impeccable build quality and attention to detail with a miles long finish."}
{"Unnamed: 0":768,"name":"Lewis Cellars Reserve Merlot 1995","grape":null,"region":"Napa Valley, California","variety":"Red Wine","rating":92.0,"notes":"When asked to describe our Reserve Merlot as briefly as possible our response is \"velvet hammer.\" Supple and velvety rich on the palate, layered with dark ripe fruit, the wine finishes polished and round."}
{"Unnamed: 0":769,"name":"Lewis Cellars Sauvignon Blanc 2016","grape":null,"region":"Napa Valley, California","variety":"White Wine","rating":90.0,"notes":"The warm, vibrant character and seductive imagery of Paul Gauguin's Tahiti are captured in our 2016 Sauvignon Blanc. Awash in ripe mango, guava and papaya and laced with tropical blossoms, vanilla and spice, the wine is lush and luxuriant, fruitful to the core, yet draped in native acidity and a fleck of salinity that frame and lengthen the canvas."}
{"Unnamed: 0":770,"name":"Lewis Cellars Sauvignon Blanc 2018","grape":null,"region":"Napa Valley, California","variety":"White Wine","rating":92.0,"notes":"Like a sailplane this 2018 Sauvignon Blanc soars with alluring floral spice, lemon-lime zest and hints of vanilla. A leading edge of native acidity frames a camber line of ripe mango and tropical fruit that tails gracefully with succulent lime skin and subtle mineral."}
